In [1]:
# 7.1 Handling Missing Data

In [2]:
# for data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent misssing data
# this is called  asentienl value; when present, it indicates a missing (or null) value
import pandas as pd
import numpy as np

float_data = pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
# .isna() gives a Boolean Series of result; null = TRUE
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# as alternative to 'NA', a built-in 'None' (case-sensitive) value is also used
string_data = pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
# NA handling object methods
# .dropna() : filter axis labels based on whether values for eahc label have missing data
#          with varying thresholds for how much missing data to tolerate
# .fillna() : fill in missing data with some value or using an interpolation method such as "ffill" or "bfill"
# .isna() : return Boolean values indicating which values are missing/NA
# .notna() : negation of isna, returns True for non-NA values and False for NA values

In [9]:
# Filtering Out Missing Data

In [10]:
# using .dropna() in Series
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# another way to filter out missing data in Series
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
# removing missing data in DataFrames - either drop rows or columns that are all NA, or only dropping rows or columns containing any NA
# .dropna() by default drops any row containing a missing value
data = pd.DataFrame([[1,6.5,3.],[1.,np.nan,np.nan],
                     [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()
# drops all the rows containing any NA

     0    1    2
0  1.0  6.5  3.0

In [15]:
# passing how = "all" will drop only rows that are all NA
data.dropna(how="all")

# these functions don't modify the original object, just creates a new object

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# to drop columns containing NA, pass the argument axis = "columns"
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# only keeping rows contianing at most a certain number of missing observations
# indicate this with the thresh argument
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0  1.727987  1.236485  0.520799
1  0.642867  0.817818  0.852358
2  1.282048 -0.682954 -0.721350
3 -0.303480  0.837944 -1.144744
4  0.026633 -0.603445 -0.306248
5  1.096901  0.309833  0.014388
6  0.850482 -1.074430  0.792511

In [19]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  1.727987       NaN       NaN
1  0.642867       NaN       NaN
2  1.282048       NaN -0.721350
3 -0.303480       NaN -1.144744
4  0.026633 -0.603445 -0.306248
5  1.096901  0.309833  0.014388
6  0.850482 -1.074430  0.792511

In [20]:
df.dropna()

          0         1         2
4  0.026633 -0.603445 -0.306248
5  1.096901  0.309833  0.014388
6  0.850482 -1.074430  0.792511

In [21]:
# using argument thresh
df.dropna(thresh=2)
# thresh = 2 means non-NaN threshold is 2 (at least 2 non-NaN values), if threshold not met, drop
# thresh = N means the row needs N "votes" to stay in the DataFrame

          0         1         2
2  1.282048       NaN -0.721350
3 -0.303480       NaN -1.144744
4  0.026633 -0.603445 -0.306248
5  1.096901  0.309833  0.014388
6  0.850482 -1.074430  0.792511

In [22]:
# Filling In Missing Data

In [23]:
# .fillna() : filling NaN with a constant
df.fillna(0)

          0         1         2
0  1.727987  0.000000  0.000000
1  0.642867  0.000000  0.000000
2  1.282048  0.000000 -0.721350
3 -0.303480  0.000000 -1.144744
4  0.026633 -0.603445 -0.306248
5  1.096901  0.309833  0.014388
6  0.850482 -1.074430  0.792511

In [24]:
# using fillna() with a dictioinary, can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0  1.727987  0.500000  0.000000
1  0.642867  0.500000  0.000000
2  1.282048  0.500000 -0.721350
3 -0.303480  0.500000 -1.144744
4  0.026633 -0.603445 -0.306248
5  1.096901  0.309833  0.014388
6  0.850482 -1.074430  0.792511

In [25]:
# the same interpolation methods available for reindexing can be used with fillna()
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0 -0.778042  0.088271  0.860713
1  0.000025  0.620280 -0.570208
2  1.355648  0.453042 -0.804245
3  0.959749  0.647315  0.079205
4  0.377750 -1.396355 -1.081522
5  0.242886 -0.424465  0.493962

In [26]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0 -0.778042  0.088271  0.860713
1  0.000025  0.620280 -0.570208
2  1.355648       NaN -0.804245
3  0.959749       NaN  0.079205
4  0.377750       NaN -1.081522
5  0.242886       NaN  0.493962

In [27]:
df.iloc[4:,2] = np.nan
df

          0         1         2
0 -0.778042  0.088271  0.860713
1  0.000025  0.620280 -0.570208
2  1.355648       NaN -0.804245
3  0.959749       NaN  0.079205
4  0.377750       NaN       NaN
5  0.242886       NaN       NaN

In [28]:
df.fillna(method="ffill")
# "ffill" means forward fill; as in Excel "Duplicate Down"
# the NaN values are filled with the preceding non-NaN values, however, ffill stops when it hits a new non-NaN value
# opposite of "ffill" is "bfill" (back fill)

          0         1         2
0 -0.778042  0.088271  0.860713
1  0.000025  0.620280 -0.570208
2  1.355648  0.620280 -0.804245
3  0.959749  0.620280  0.079205
4  0.377750  0.620280  0.079205
5  0.242886  0.620280  0.079205

In [29]:
df.fillna(method="ffill",limit=2)

# "limit = 2" means limit the fill to 2 rows

          0         1         2
0 -0.778042  0.088271  0.860713
1  0.000025  0.620280 -0.570208
2  1.355648  0.620280 -0.804245
3  0.959749  0.620280  0.079205
4  0.377750       NaN  0.079205
5  0.242886       NaN  0.079205

In [30]:
# with .fillna() simple data imputation using median or mean statistics is available
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())
# fill the NaN values with .mean()

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
# .fillna() function arguments
# value : scalar value or dictionary-like object to use to fill missing values
# method : interpolation method - one of "bfill" or "ffill"; default is None
# axis : axis to fill on ("index" or "columns"); default is axis="index"
# limit : for ffill and bfill, maximum number of consecutive periods to fill

In [33]:
# Data Transformation

In [34]:
# Removing Duplicates

In [35]:
# removing duplicate rows
data = pd.DataFrame({"k1":["one","two"]*3 + ["two"],"k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
# DataFrame .duplicated() method returns a Boolean Series indicating whether each row is a duplicate oe nor
# duplicate means its column values are exactly equal to those in an earlier row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# relatedly, drop_duplicates() returns a DataFrame with rows where the duplicated array is False filtered out
data.drop_duplicates()

# both methods, .duplicated() and .drop_duplicates() by default consider all of the columns;
# alternatively, can specify any subset of them to detect duplicates

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
# having an additional column of values, and want to filter duplicates based only on the "k1" column
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
# set column with subset argument
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
# .duplicated() and .drop_duplicates() by default keep the first observed value combination
# passing keep="last" argument will return the last one
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
# Transformming Dta Using a Function or Mapping
# transformation based on the values in an array, Series, or column in a DataFrame
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                     "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
# suppose we wanted to add a column indicating the type of animal for each food
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [43]:
# .map() method on a Series accepts a function or dictionary-like object containing a mapping
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
# could also have passed a function that does all the work
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
# using .map() is a convenient way to perform element-wise transformatioins and other data cleaning-related operations

In [46]:
# Replacing Values
# .map() can be used to modify a subset of values in an object,
# but .replace() provides a simpler and more flexible way
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
# using "-999" values as sentinel values for missing data - replacing those with NA values
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
# replacing multiple values at once - passing a list with substitute values
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
# replacing different values for each, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
# passing argument can also be a dictionary
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
# renaming axis indexes
# axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects
# modifying the axes in place without creating a new data structure
data = pd.DataFrame(np.arange(12).reshape((3,4)),
        index = ["ohio","Colorado","New York"],
        columns = ["one","two","three","four"])
data

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
# .map() method for axis indexes, just like in Series
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [57]:
# can assign to the index attribute, modifying the DataFrame in place
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [58]:
# if wanting to create a transformed version without modifying the origina, .renam() can be used
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [59]:
# .rename() can be used in conjuction with a dictionary-like object
data.rename(index={"OHIO":"INDIANA"},
           columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [62]:
# Discretization and Binning
# data about a group of people in a study, gropuping them into discreet age buckets
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [61]:
# bins = 18 to 25, 26 to 35, 36 to 60, and 61 and older
# use pd.cut()
bins = [18,25,35,60,100]
age_categories = pd.cute(ages,bins)
age_categories

AttributeError: module 'pandas' has no attribute 'cute'

In [63]:
bins = [18,25,35,60,100]
age_categories = pd.cut(ages,bins)
age_categories
# each bin is identified by a special interval value type containing lower and upper limit of each bin

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
# data codified in numberical integers (the "pointer" to the category)
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [65]:
# index of unique labels created; telling what the buckets are called, the "reference table"
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [66]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [67]:
# pd.value_counts() are the bin counts for the result of pd.cut()
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [72]:
# in the string representation of an interval, a parenthesis means that the side is open (exclusive)
# square bracket means it's closed (inclusive)
# can change which side is closed by passing "right = False"
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [74]:
# can overrid the default interval-based bin labeling, by passing a list or arroy to the labels
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [75]:
# passing an integer number of bins to pd.cut() instead of explicit bin edges,
# it will compute equal-length bins based on min and max values
data = np.random.uniform(size=20)
data

array([0.35441359, 0.05901113, 0.49223894, 0.02110399, 0.38046688,
       0.25221478, 0.44214983, 0.15403294, 0.69643867, 0.05896486,
       0.90697943, 0.01011503, 0.96387608, 0.54411993, 0.4263027 ,
       0.55631272, 0.50411895, 0.56332833, 0.71337579, 0.88868687])

In [76]:
pd.cut(data,4,precision=2)

[(0.25, 0.49], (0.0092, 0.25], (0.49, 0.73], (0.0092, 0.25], (0.25, 0.49], ..., (0.49, 0.73], (0.49, 0.73], (0.49, 0.73], (0.49, 0.73], (0.73, 0.96]]
Length: 20
Categories (4, interval[float64, right]): [(0.0092, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.96]]

In [77]:
# pd.qcut() bins the data based on sample quantiles
# it will obtain roughly equally sized bins (slicing in quantiles)
data = np.random.standard_normal(1000)
data

array([ 9.67535825e-01, -1.12630325e+00,  7.01682817e-01, -3.40066082e-01,
       -6.00165875e-01,  9.90571302e-02, -5.67770668e-01,  1.36501012e+00,
        3.21879843e-01,  1.80632938e+00, -6.72582077e-01,  1.53492832e+00,
        1.17710257e+00, -1.23493269e+00,  7.91773552e-01,  7.21007637e-01,
       -1.84489674e+00,  6.22171299e-01, -1.54266356e-01, -6.24962988e-01,
        3.08774936e-01, -2.18847715e+00,  1.01496867e+00, -2.00155007e+00,
        4.31830826e-01, -1.88131629e+00,  1.02097250e+00, -1.27877039e-01,
        1.01898085e+00,  8.02719564e-01, -7.09501176e-01, -4.31488973e-01,
        1.53663394e-02, -8.47655100e-01,  4.60347094e-02, -9.68733828e-01,
       -8.58339707e-01,  4.09301246e-01,  4.23737070e-01,  1.48017257e+00,
        2.16944606e-01, -3.42490044e-01,  6.78092744e-01, -1.53330694e-01,
       -1.76390995e+00, -1.80514058e-01, -2.61362166e-01, -1.07540905e+00,
        9.94937941e-03,  7.24078506e-02,  3.04626879e-01,  5.37674758e-01,
        1.16220588e+00,  1.57138948e+00,  1.69048970e+00,  4.47529589e-01,
       -1.11892763e+00,  4.39647363e-01,  9.17816001e-01, -6.49395137e-01,
       -2.43374352e+00,  1.85601272e+00, -6.44198875e-02,  2.29780661e+00,
        7.21631895e-01, -1.16322394e+00,  1.08967474e+00, -5.36978173e-01,
        1.78359926e-01,  1.90635166e-01,  1.77960643e-01,  3.46498625e-01,
       -3.01111914e-01,  9.97123542e-01,  4.73148585e-01, -3.65661338e-01,
       -5.40905055e-01, -4.49357209e-01, -9.26459769e-01,  1.00398284e-03,
        1.01264791e+00,  1.64879476e+00, -6.45577260e-01, -1.07266709e-03,
       -2.96917880e-01,  4.69327627e-01, -6.51970886e-01,  2.62956542e-01,
       -1.27813748e+00,  1.24354783e+00,  4.62284802e-01,  5.43654358e-02,
       -1.02163010e+00, -1.05582126e+00, -5.71009528e-01,  1.08040531e+00,
        1.04602126e+00,  5.99368159e-01, -1.98025024e-01, -2.47361051e-01,
        8.38403437e-01,  1.34662814e+00,  1.81779985e+00, -3.99523903e-01,
       -5.61779817e-01,  3.33016939e+00,  6.00876868e-01,  5.60391687e-01,
       -1.07594890e+00, -3.54936063e-01, -6.53996968e-02, -1.61469266e+00,
       -2.42295287e+00,  9.38240773e-01, -8.85465740e-01,  6.48135926e-01,
       -1.17371840e+00, -7.31915938e-01,  1.09470421e-01, -1.71404421e-01,
       -2.88067733e+00,  4.05537615e-02,  8.19672503e-02, -5.29321875e-01,
        1.95407849e-01, -1.30752135e+00,  2.25931646e+00, -1.51877196e+00,
        6.29191015e-01,  7.72009842e-01,  6.09950799e-01,  1.90366828e+00,
        3.36401018e-01,  1.02675266e+00,  1.22153428e+00,  1.09474936e-01,
        1.18300206e-01,  4.08054132e-01,  1.63744067e+00,  6.01425268e-02,
        3.97708486e-01,  9.31743712e-02,  1.41039562e+00, -3.09003015e-01,
        3.68320050e-01,  5.52610903e-02,  6.84039016e-01,  8.57783587e-01,
       -6.40930580e-01,  6.89119328e-01, -7.34236761e-01,  3.81280602e-01,
       -2.39033950e-01,  6.16550180e-01,  1.03436792e-01, -2.39697780e-01,
       -1.63537533e+00,  1.90688801e-01,  2.22728710e+00,  3.42282372e-01,
       -4.60176370e-01, -2.69567056e+00,  7.40872794e-01,  2.54157638e-01,
        1.06744687e+00,  1.53215108e+00, -1.23678719e+00,  1.63699987e-01,
        6.38852597e-02,  6.54183050e-01, -9.88603302e-01,  1.09752509e-01,
        3.16694979e-01,  8.83942021e-01, -2.01998262e+00,  1.34751665e+00,
       -1.16972364e+00,  6.04533071e-01,  7.90995247e-01, -1.76942933e+00,
        8.20895540e-01,  1.01557446e-01,  8.83540686e-01, -6.63709898e-01,
       -1.23202072e+00, -2.33585369e-01, -8.60727396e-01, -7.28830931e-01,
        5.41917717e-01,  8.88921603e-01, -2.28548418e+00,  2.95335567e-01,
       -8.17615632e-01, -4.81971208e-01, -2.43708515e-01, -4.29298618e-01,
       -6.40568078e-01, -7.84702213e-02,  3.57295452e-01,  1.04105860e+00,
        3.09181559e-01,  2.46989992e-01, -9.11932109e-01, -2.49623906e-01,
        1.62687441e+00, -1.00989388e+00, -1.11682389e+00,  5.17087082e-01,
       -6.69541583e-01, -2.37746085e-01, -7.47877987e-01, -7.59484842e-01,
        1.41728398e+00, -1.63932587e-01, -1.08709531e+00,  1.58504068e+00,
       -1.08137806e+00, -9.92873534e-01, -6.73363923e-02, -1.61635390e+00,
       -1.09066832e-01, -4.16628470e-01, -1.52103556e+00,  1.02376081e+00,
        2.62441456e-01, -1.32833053e-01, -2.53032378e-01, -3.16998220e-01,
       -2.13976830e-01,  1.89639595e-02, -1.25289110e+00,  9.51734561e-01,
       -2.41400832e-01,  1.28635041e+00, -8.00818357e-01, -1.36675050e+00,
       -7.36376018e-01, -1.06681868e+00,  1.29589726e+00, -1.22270697e+00,
       -1.30708318e-02, -1.43381200e+00, -1.12335341e+00,  8.18020755e-01,
        1.06878715e+00, -1.25079178e+00,  2.53611136e+00, -8.07943747e-01,
        5.54715282e-01, -5.74075218e-01, -5.82423176e-01, -1.24165346e+00,
        3.08090539e-01, -1.09946984e+00, -3.72086380e-01, -1.97435419e+00,
       -7.34815242e-01, -6.26282884e-01, -1.46878421e+00,  1.01537560e+00,
       -1.21512599e+00, -1.25760942e+00, -2.23719515e+00,  4.48498710e-01,
        5.84864246e-01,  1.07894788e+00,  7.42840360e-01, -5.29013671e-01,
        5.45237008e-01, -2.98095234e-01,  9.03843962e-01, -5.83323401e-01,
       -1.55638722e+00,  1.14851225e+00, -1.38902708e+00,  1.32492204e+00,
        1.75751585e+00,  2.42599534e+00, -1.41510189e+00,  3.94013652e-02,
        2.46242881e+00, -4.89165608e-01,  1.13904973e-01,  6.84645446e-02,
       -2.99432203e-01, -1.01568413e+00,  3.85234098e-01,  6.72321187e-01,
        8.54145421e-01, -2.19431079e-01,  3.81307641e-01, -1.25739069e+00,
        2.68170233e+00, -4.33146294e-01, -2.47586385e+00,  1.08240642e+00,
        4.96519879e-01, -1.06435384e+00, -1.92339340e-01,  8.24279915e-02,
       -4.49569832e-01,  1.59951645e-01,  5.93490536e-01,  1.11412050e+00,
       -1.11954343e+00,  1.26272892e+00, -2.99522034e-01,  4.37631174e-01,
        6.80369843e-01, -5.36268823e-01, -4.07819451e-01, -1.18803166e+00,
       -5.20104017e-01,  9.47855931e-02, -1.03013711e+00,  1.45631641e+00,
       -5.81412146e-01, -1.99011883e-01, -7.84413580e-02, -1.10341349e+00,
        5.97804250e-01, -1.58710008e+00, -1.01032643e+00, -5.28705793e-01,
       -9.32856166e-01, -6.19826765e-01, -1.98156733e+00,  5.35141198e-01,
        1.63337451e+00,  1.20833523e+00, -1.38550844e+00,  1.66743709e+00,
        1.17642178e+00,  2.80320715e-01,  3.33129298e-01, -2.05086136e-01,
       -5.14248718e-01,  6.85974823e-01,  1.59100578e-01, -1.34351929e+00,
       -5.53316136e-01, -5.98059035e-01, -8.55834402e-01,  5.75752005e-01,
       -4.22133052e-01,  3.88494764e-01, -4.55100217e-01, -1.10288070e+00,
        4.47761861e-01, -6.36642433e-01,  3.23232847e-01,  1.05160655e+00,
        1.26733782e+00,  1.33203438e-01,  5.79231117e-01,  4.65751920e-01,
       -8.52323342e-01, -2.28221741e+00,  6.75330345e-02, -1.41478932e+00,
        8.18629952e-01, -1.14303342e+00, -5.22900086e-01,  7.87880619e-01,
        2.60003459e-01,  2.33035040e+00, -1.32006752e+00,  3.11321042e-01,
       -1.50301767e+00, -3.04621139e-01,  1.41325496e+00, -2.14304245e-01,
       -6.07076254e-01, -1.03346703e+00,  5.74836658e-01,  5.57508437e-02,
       -6.44662812e-01, -3.56627011e-01, -1.32020552e+00,  7.48649660e-02,
        2.45398039e-01, -6.53445104e-01,  1.05436210e+00,  6.00013124e-01,
        5.13413657e-01,  4.97405376e-01, -5.84204105e-01,  1.22929741e+00,
        5.51431372e-01,  1.22362784e+00, -3.28348822e-01,  1.38651613e+00,
        4.64372631e-01,  4.06206698e-01, -6.44350895e-01,  1.57419890e+00,
       -1.14086602e-01,  1.28091312e+00, -4.61756821e-01,  2.24855474e-01,
        1.01812878e+00, -8.99942799e-01, -1.21517272e+00, -1.82054087e-02,
       -2.56250333e-01,  4.96569019e-01,  3.08011137e-01,  6.24974545e-01,
        5.40463644e-01, -1.12109743e+00,  6.57807196e-02,  1.50007892e+00,
        1.57624640e+00, -1.93073874e+00, -4.65068471e-01, -4.67010524e-02,
       -1.53663358e+00, -2.32716698e-02, -2.36377821e-01, -7.32609391e-02,
       -9.59738338e-01,  2.81368699e-01, -2.92234268e-01, -1.84006850e+00,
       -8.20129068e-01, -2.84009898e-01,  6.24424937e-01,  2.49064218e+00,
        4.39617781e-01, -9.07551121e-01,  4.63412814e-01, -4.24977776e-01,
       -9.16826713e-01, -1.10260904e+00,  9.21877953e-01,  3.19185556e-01,
       -5.69120371e-01, -8.11509819e-01, -7.84645895e-01,  5.12889822e-01,
       -4.21240507e-01,  4.24275565e-01, -1.01317477e-01, -2.44033079e-01,
       -2.84945367e-01, -1.00255027e+00,  1.67193762e+00, -4.25435944e-01,
       -5.43039792e-01, -5.32975414e-01,  7.03291031e-01, -9.86893557e-01,
        1.27495881e+00,  6.04511062e-01,  1.96750119e+00, -6.28368639e-01,
       -6.36137518e-01,  2.78543001e+00, -8.51434765e-01,  8.01412592e-01,
        2.23818192e-01, -2.32378309e-01, -7.29423346e-01, -5.23918471e-01,
        9.43182889e-01,  6.88029128e-01,  8.69543014e-01,  2.47286235e-01,
        4.23480344e-01, -1.15644639e+00,  8.01586192e-01, -8.97711696e-01,
       -6.27171901e-02,  6.46040695e-01,  8.30511631e-01, -1.10616577e+00,
        1.40408889e+00, -1.88159124e-01, -1.06829002e+00,  2.22860608e-01,
        3.55584283e-01,  1.07839703e+00, -9.40707306e-01, -4.99138410e-01,
       -3.08496729e-01, -9.75596038e-01, -8.36055447e-01, -1.03077576e+00,
       -3.99534817e-01, -4.19638944e-02, -1.23390694e+00,  1.94638009e+00,
        8.35758383e-01,  1.83648904e-01,  9.75243820e-01, -1.51321914e+00,
       -1.51636363e+00,  7.70877665e-01, -1.22518780e+00,  2.09277338e+00,
        4.43304702e-01, -1.24266283e+00,  1.04341314e+00,  7.28510762e-01,
        4.79220878e-01,  9.10336333e-01,  4.13582459e-01,  5.25759171e-01,
       -1.71833693e-01,  3.89768738e-01,  1.65812949e-01, -9.01204413e-01,
       -4.51714660e-01, -1.17645076e+00,  7.70017055e-02, -2.73425408e-01,
        3.79533226e-01,  9.68205183e-01, -8.10633616e-01, -2.88298743e-01,
        3.14133110e-01,  5.53039580e-01, -1.28044039e+00, -1.57086922e+00,
        9.00381968e-01,  1.34724375e+00, -5.51832643e-01, -4.66169764e-02,
        1.73806430e+00,  9.59505580e-01, -2.75579261e-01,  1.01647189e+00,
        1.27353949e+00,  1.66050247e-01,  8.11049802e-02,  9.65427450e-01,
        7.68772395e-01,  1.40356240e+00,  6.76840236e-01, -1.00678130e+00,
        6.02489502e-01, -2.10581722e+00,  7.77437666e-01, -1.35215271e+00,
       -1.53257436e-01,  7.16212390e-02, -6.82898498e-02, -9.00884289e-01,
        1.07094353e+00, -6.37982024e-01, -7.74907222e-01,  1.45836776e+00,
       -1.76193392e-01, -3.24701643e-01, -5.65082089e-02, -1.32799781e+00,
        4.65591489e-01, -7.47814494e-01, -9.95371247e-01,  6.47710002e-01,
        4.33175988e-01, -1.77356331e-01, -2.27155652e+00, -1.75017167e+00,
       -1.30695146e+00, -7.89571266e-02, -2.55100503e-01,  7.68186586e-01,
        2.98727587e-01,  4.86945420e-01,  6.97809036e-01,  2.51843439e-01,
       -1.30015374e+00,  9.13583952e-01, -7.85421843e-01, -8.99408657e-03,
       -1.52221904e+00,  1.71158750e+00,  3.17579629e-01, -2.38026196e+00,
        7.86331539e-01, -5.75774097e-02, -1.33190391e+00, -4.71089871e-01,
        8.69533208e-01, -4.37352514e-01, -6.47792101e-01, -3.09080327e-01,
       -7.20840898e-01,  5.51637243e-01, -4.90089945e-01, -1.55077171e+00,
        3.17911013e-01,  3.91150469e-01, -1.35835969e+00,  4.88794831e-01,
       -1.49969279e+00,  4.39488039e-01,  1.92545522e+00, -1.28452545e+00,
        1.32205006e+00, -1.15829814e+00, -8.81612218e-01, -2.99362768e-01,
       -1.16084047e+00, -1.22423122e+00, -3.59655953e-01,  1.89205787e-01,
        2.00475694e-01, -1.60658159e+00, -8.60435272e-01,  3.54324714e-01,
        6.55734430e-01,  1.05725538e+00, -5.44781772e-01, -4.70648440e-01,
       -1.47903807e+00, -4.86040249e-01,  9.08102880e-01,  2.62815816e-01,
        7.46436178e-01, -7.46411561e-02,  1.26633522e+00, -2.87924198e-01,
       -1.12099655e-01, -1.12979276e+00,  3.64554870e-01,  6.82104683e-01,
       -1.26759753e+00, -3.34990510e-01,  1.07484097e+00, -1.15340404e+00,
       -9.57549330e-01, -1.31693924e-01, -9.78181502e-03, -9.59708062e-02,
        1.23166871e+00, -4.86096732e-01, -1.63066450e-01,  2.66291427e-01,
       -1.08424297e+00, -9.62038368e-01, -1.56023519e-01,  8.75188365e-02,
        6.46511388e-01, -1.08508680e+00, -1.86051779e+00,  1.10106390e-01,
        2.43042709e-01,  3.45006788e-01,  4.87596958e-01, -1.57037513e+00,
        3.54108824e-01, -4.76236192e-01, -1.24286046e+00, -8.11755751e-01,
        1.90101014e-01,  2.03573716e+00,  5.04521119e-01, -1.40877614e+00,
        1.95118123e+00,  4.64592828e-01, -3.61787619e-01,  8.33584376e-01,
       -2.06156302e+00,  3.24594344e-01,  5.40271589e-02, -2.86162304e-01,
       -1.50876652e-01, -7.30702363e-01, -4.22740642e-03, -5.74544312e-01,
        5.58397838e-01,  4.53289233e-01, -2.34437801e-01, -3.56806337e-01,
        7.23382775e-01, -1.09263106e+00, -8.87642454e-01,  1.60350462e+00,
        9.24412528e-01,  4.88881485e-01,  8.32196743e-01, -1.92365949e+00,
       -4.45645504e-01,  5.51571695e-01, -1.09799553e+00, -4.11903721e-01,
        5.11223480e-01,  6.33346666e-01,  7.33831817e-01, -1.04635579e+00,
       -6.93878489e-01, -7.69165185e-01, -7.45429252e-01,  1.70457415e+00,
        1.22030911e+00, -3.04718135e-01,  6.11226507e-01, -2.29832091e-01,
        4.01587655e-01,  6.45285216e-02,  7.61498180e-01, -1.30336006e+00,
        8.78770013e-01,  3.68344362e-01, -4.43248622e-01, -1.12348002e-01,
        1.13470088e+00, -1.50811094e+00,  1.43931538e+00, -4.61429255e-01,
        5.66730134e-01, -7.34931152e-01,  2.20120136e-01, -9.16888407e-01,
        9.07639168e-01, -1.25172441e+00, -5.27133165e-01, -1.99829661e-01,
        2.03064822e-01,  1.61474881e+00,  3.74693428e-01,  5.99355467e-03,
        6.88099033e-01,  5.28277155e-03, -1.60733275e+00,  1.36880946e+00,
       -7.86055782e-01,  1.82214004e+00,  4.97064805e-01,  1.48712095e+00,
        2.74350275e-01,  5.53442215e-01, -2.34790698e-01, -7.65625268e-01,
       -1.12496524e+00,  1.01215581e+00, -1.75296295e+00,  2.36898036e+00,
       -2.64974347e-01, -1.13676512e+00, -1.95405450e+00,  1.53643750e-01,
       -4.37199773e-01,  6.83148800e-02, -4.16788696e-02, -3.13926599e-01,
        8.48350236e-01, -2.41048962e+00, -3.89034314e-01, -1.15169874e-01,
        1.41173774e+00, -1.13305508e-01, -2.10424108e+00, -6.47450923e-01,
       -3.84774855e-01, -1.41035988e+00, -1.59673941e+00,  2.33648688e+00,
       -2.10579264e+00, -3.58887691e-01,  3.96379144e-01,  1.13146320e+00,
        1.85109888e+00,  1.56987184e+00, -7.14454047e-01, -5.96997033e-01,
        7.95816770e-02, -6.88148339e-01,  4.07981222e-03, -8.89453291e-01,
        9.56684919e-02, -1.66555045e+00, -1.24333118e+00,  2.68799470e-01,
        1.00459248e+00, -7.68691495e-01,  1.72690862e-01,  1.92083436e+00,
       -6.91149176e-01, -1.82452656e-01,  6.59825737e-03, -3.82667538e-01,
       -7.34755125e-01,  1.62294531e+00,  1.18719706e+00,  4.22711391e-01,
        1.12053634e+00,  1.29513131e+00,  1.15405880e+00, -8.48506280e-01,
       -1.77850679e+00,  1.06363338e+00,  2.25549447e-01,  9.83378406e-01,
       -1.58680335e+00, -9.34677394e-01, -6.95357765e-01,  9.95902512e-01,
       -5.27225249e-01, -6.47291477e-01,  8.75835613e-01,  4.34628784e-01,
        3.02935471e-02,  1.27766433e-01,  4.84163108e-01, -8.90557934e-01,
        1.24271971e+00,  1.61595988e+00,  4.89412643e-01, -1.41773967e-01,
        1.63028641e+00, -9.99937764e-01,  9.01840413e-01,  3.33605655e-01,
       -1.48490987e+00,  9.80511372e-01, -4.95977946e-01, -1.94170967e-01,
       -2.87817228e+00, -1.21631864e+00,  3.81913796e-01,  1.68038534e+00,
        1.11176203e+00, -1.42942117e-01, -1.39309645e+00,  1.31425317e+00,
       -6.68693755e-01,  1.60799360e+00,  5.73486951e-01, -7.65059930e-01,
       -3.63047623e-01,  3.26647297e-01,  8.08815312e-02,  1.57639288e+00,
        4.17520793e-04,  4.22820175e-01,  6.47146762e-02, -7.98169206e-01,
        1.56082376e+00,  1.19963433e+00,  1.71685006e+00, -2.41931903e-01,
        9.20247766e-01,  2.49236497e-01, -6.65951530e-01, -2.09348588e+00,
        5.63252738e-01, -7.61634548e-01, -1.70551591e-01, -5.09892879e-02,
        2.63066337e+00, -7.41158054e-01,  7.51223383e-01, -5.06540325e-01,
       -4.46531388e-02, -7.88972517e-01, -1.11919133e+00, -3.41345517e-01,
        1.05299416e+00, -7.43599278e-01, -1.03658075e+00,  2.42020193e+00,
        1.07818922e-01, -6.33235160e-01, -3.76637765e-01,  9.42765794e-01,
        9.01167093e-01, -1.54858474e-01, -5.21853998e-01,  1.48891964e+00,
       -1.69516148e+00,  1.40270753e-01,  4.16830803e-01, -6.68138221e-01,
        1.66469895e-01, -8.86801863e-01, -2.60609465e-01,  1.03771932e+00,
        8.37670110e-01, -3.49080202e-01, -7.56987026e-01, -1.53893933e+00,
        9.05847465e-01, -4.28203760e-01,  2.13795715e+00,  2.09481224e+00,
       -1.92168459e-02,  4.58120073e-01,  5.88536978e-01, -2.54685527e-01,
       -1.13087280e+00, -3.59880527e-01,  8.98199596e-01,  5.01346767e-02,
       -5.38583302e-01,  5.21461815e-01,  2.07595961e+00, -2.05784349e-01,
        6.89547250e-01, -6.46857173e-02,  8.79031415e-01,  3.38608134e-01,
        4.44468319e-01, -1.33201057e+00,  3.77035552e-01,  1.04303455e+00,
        2.68047098e-02,  2.06698793e-02,  4.00668653e-01, -1.49386224e+00,
        1.15563871e+00,  6.13669379e-01,  2.52302865e-01, -8.21700081e-01,
       -5.36332490e-01,  1.07646773e+00,  8.36085475e-01, -9.54825862e-01,
        2.17814833e-01,  4.55297563e-01, -5.42430583e-01,  2.57109593e+00,
        2.54745783e-01,  9.06001991e-01, -7.92933959e-02, -8.64470027e-02,
       -1.48383618e-01, -1.01460964e+00,  1.77579135e-01,  3.72593336e-01,
       -8.75132991e-01,  8.78606082e-01,  1.80541398e-01, -1.15312314e+00,
       -8.51015294e-01,  3.07010667e-01,  1.12433598e-01, -8.45577844e-01,
       -4.01528662e-01,  7.92997382e-01,  1.33874162e+00,  1.03904620e+00,
       -9.68559635e-01,  3.31474702e-01,  1.88287111e-01, -1.27044675e+00,
       -1.81436960e+00,  6.96416067e-01,  4.46037247e-02,  1.43827491e+00,
        3.79698243e-01, -6.13255877e-01, -6.26497547e-01,  4.94736965e-01,
        8.82608473e-01, -5.71815287e-01,  2.29364359e-01,  2.03722906e+00,
        1.17000344e+00, -1.64646428e+00,  3.29831891e-02,  9.15844991e-02,
        2.07990772e+00,  1.30638973e+00,  1.51972888e+00,  1.12727529e-01,
        1.24479387e-01,  9.19716366e-01,  2.21865640e-02, -2.44093547e-01,
        2.34176967e-01,  1.37193335e-01,  1.37019025e+00,  9.67681225e-01,
       -5.65961942e-01, -1.12154072e-01, -1.40754747e-01,  3.92855924e-01,
       -9.97381218e-02, -4.44312417e-01, -2.81661520e-01, -1.10557688e+00,
        1.43224722e-01, -5.71605920e-01,  4.81045270e-02, -7.81390137e-01,
       -2.39646841e-02, -2.83896925e-01,  8.98592255e-01,  1.19578391e+00,
       -5.23678226e-02, -5.43448684e-01,  4.88653482e-01,  3.77681995e-01,
        7.96417150e-01,  2.53468319e-01, -6.60022252e-01, -6.60604472e-01])

In [79]:
quartiles = pd.qcut(data,4,precision=2)
quartiles

[(0.65, 3.33], (-2.8899999999999997, -0.67], (0.65, 3.33], (-0.67, 0.013], (-0.67, 0.013], ..., (0.013, 0.65], (0.65, 3.33], (0.013, 0.65], (-0.67, 0.013], (-0.67, 0.013]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.8899999999999997, -0.67] < (-0.67, 0.013] < (0.013, 0.65] < (0.65, 3.33]]

In [80]:
pd.value_counts(quartiles)

(-2.8899999999999997, -0.67]    250
(-0.67, 0.013]                  250
(0.013, 0.65]                   250
(0.65, 3.33]                    250
dtype: int64

In [81]:
# similar to pd.cut(), can pass own quantiles (between 0 and 1, inclusive)
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-2.8819999999999997, -1.235]    100
(-1.235, 0.0127]                 400
(0.0127, 1.233]                  400
(1.233, 3.33]                    100
dtype: int64